levkropp/flexe/tests/test_esp32s3_extmem.c
    int before = periph_unhandled_count(periph);
    mem_write32(mem, 0x60000000u, 'S');
    mem_write32(mem, 0x60010000u, '3');
    mem_write32(mem, 0x6002E000u, '!');
    ASSERT_EQ(periph_uart_tx_count_num(periph, 0), 1);
    ASSERT_EQ(periph_uart_tx_count_num(periph, 1), 1);
    ASSERT_EQ(periph_uart_tx_count_num(periph, 2), 1);
    ASSERT_EQ(periph_uart_tx_buf_num(periph, 0)[0], 'S');
    ASSERT_EQ(periph_uart_tx_buf_num(periph, 1)[0], '3');
    ASSERT_EQ(periph_uart_tx_buf_num(periph, 2)[0], '!');

    static const uint8_t rx[] = { 'O', 'K' };
    ASSERT_EQ(periph_uart_rx_inject_num(periph, 0, rx, sizeof(rx)),
              sizeof(rx));
    ASSERT_EQ(mem_read32(mem, 0x6000001Cu) & 0x3FFu, 2u);
    ASSERT_EQ(mem_read32(mem, 0x60000068u), 2u << 11);
    ASSERT_EQ(mem_read32(mem, 0x60000000u), 'O');
    ASSERT_EQ(mem_read32(mem, 0x60000068u), 1u | (2u << 11));
    ASSERT_EQ(mem_read32(mem, 0x6000007Cu), 0x02008270u);
    ASSERT_EQ(periph_unhandled_count(periph), before);

    periph_destroy(periph);
    mem_destroy(mem);
}

TEST(peripherals_model_target_described_secondary_core_control) {
    const flexe_target_desc_t *s3 =
        flexe_target_by_id(FLEXE_TARGET_ESP32S3);
    xtensa_mem_t *mem = mem_create_for_target(s3);
    esp32_periph_t *periph = periph_create(mem);
    ASSERT_TRUE(mem != NULL);
    ASSERT_TRUE(periph != NULL);
    if (!mem || !periph) {
        periph_destroy(periph);
        mem_destroy(mem);
        return;
    }

    const uint32_t control = s3->secondary_core.base +
                             s3->secondary_core.control_offset;
    const uint32_t boot = s3->secondary_core.base +
                          s3->secondary_core.boot_address_offset;
    ASSERT_EQ(mem_read32(mem, control), 1u << 2);
    ASSERT_EQ(mem_read32(mem, boot), 0u);
    ASSERT_FALSE(periph_app_cpu_released(periph));

    mem_write32(mem, boot, 0x403751E4u);
    ASSERT_EQ(periph_app_cpu_boot_addr(periph), 0x403751E4u);
    mem_write32(mem, control, (1u << 2) | (1u << 1));
    ASSERT_FALSE(periph_app_cpu_released(periph));
    mem_write32(mem, control, 1u << 1);
    ASSERT_TRUE(periph_app_cpu_released(periph));
    uint32_t rtc_options = s3->rtc_cntl.base +
                           s3->rtc_cntl.cpu_stall_options_offset;
    uint32_t rtc_high = s3->rtc_cntl.base +
                        s3->rtc_cntl.cpu_stall_high_offset;
    mem_write32(mem, rtc_options,
                s3->rtc_cntl.cpu_stall_options_reset | 2u);
    ASSERT_TRUE(periph_app_cpu_released(periph));
    mem_write32(mem, rtc_high, 0x21u << 20);
    ASSERT_TRUE(periph_cpu_stalled(periph, 1u));
    ASSERT_FALSE(periph_app_cpu_released(periph));
    mem_write32(mem, rtc_options,
                s3->rtc_cntl.cpu_stall_options_reset);
    ASSERT_FALSE(periph_cpu_stalled(periph, 1u));
    ASSERT_TRUE(periph_app_cpu_released(periph));
    mem_write32(mem, control, (1u << 1) | (1u << 0));
    ASSERT_FALSE(periph_app_cpu_released(periph));

    int before = periph_unhandled_count(periph);
    ASSERT_EQ(mem_read32(mem, s3->secondary_core.base + 8u), 0u);
    ASSERT_EQ(periph_unhandled_count(periph), before + 1);

    periph_destroy(periph);
    mem_destroy(mem);
}

TEST(peripherals_model_target_described_s3_interrupt_fabric) {
    const flexe_target_desc_t *s3 =
        flexe_target_by_id(FLEXE_TARGET_ESP32S3);
    const flexe_interrupt_matrix_desc_t *desc = &s3->interrupt_matrix;
    xtensa_mem_t *mem = mem_create_for_target(s3);
    esp32_periph_t *periph = periph_create(mem);
    xtensa_cpu_t cpu[2];
    ASSERT_TRUE(mem != NULL);
    ASSERT_TRUE(periph != NULL);
    if (!mem || !periph) {
        periph_destroy(periph);
        mem_destroy(mem);
        return;
    }

    for (unsigned core = 0; core < 2u; core++) {
        xtensa_cpu_init_for_target(&cpu[core], s3);
        cpu[core].mem = mem;
        cpu[core].core_id = (int)core;
        ASSERT_EQ(mem_read32(mem, desc->base + desc->map_offset[core]),
                  desc->map_reset);
        ASSERT_EQ(mem_read32(mem, desc->base + desc->map_offset[core] +
                                 (desc->source_count - 1u) * 4u),
                  desc->map_reset);
        ASSERT_EQ(mem_read32(mem,
                             desc->base + desc->clock_gate_offset[core]),
                  desc->clock_gate_reset);
        ASSERT_EQ(mem_read32(mem, desc->base + desc->date_offset[core]),
                  desc->date_reset);
    }
    periph_attach_cpus(periph, &cpu[0], &cpu[1]);

    const unsigned from0 = desc->software_interrupt_source_base;
    const unsigned from1 = from0 + 1u;
    const uint32_t map0 = desc->base + desc->map_offset[0];
    const uint32_t map1 = desc->base + desc->map_offset[1];
    const uint32_t software = desc->software_interrupt_base +
                              desc->software_interrupt_offset;

    /* Each core owns an independent source-to-CPU-line map. */
    mem_write32(mem, map0 + from0 * 4u, 2u);
    mem_write32(mem, map1 + from1 * 4u, 0u);
    ASSERT_EQ(mem_read32(mem, map0 + from0 * 4u), 2u);
    ASSERT_EQ(mem_read32(mem, map1 + from1 * 4u), 0u);
    ASSERT_EQ(periph_intr_matrix_get(periph, 0, 2), (int)from0);
    ASSERT_EQ(periph_intr_matrix_get(periph, 1, 0), (int)from1);

    /* Software generators are one-bit, level-triggered sources. Unrouted
     * cores observe raw status but do not receive a CPU interrupt. */
    mem_write32(mem, software, UINT32_MAX);
    ASSERT_EQ(mem_read32(mem, software), 1u);
    ASSERT_TRUE(periph_interrupt_pending(periph, (int)from0));
    ASSERT_EQ(cpu[0].interrupt & (1u << 2), 1u << 2);
    ASSERT_EQ(cpu[1].interrupt & (1u << 2), 0u);

    mem_write32(mem, software + desc->software_interrupt_stride, 1u);
    ASSERT_EQ(cpu[0].interrupt & 1u, 0u);
    ASSERT_EQ(cpu[1].interrupt & 1u, 1u);
    uint32_t status_bits = (1u << (from0 - 64u)) |
                           (1u << (from1 - 64u));
    for (unsigned core = 0; core < 2u; core++)
        ASSERT_EQ(mem_read32(mem, desc->base + desc->status_offset[core] +
                                 2u * 4u), status_bits);

    /* Remapping a live level transfers it, and clock gating suppresses only
     * delivery: raw status and pending state survive until the source clears. */
    mem_write32(mem, map0 + from0 * 4u, 3u);
    ASSERT_EQ(cpu[0].interrupt & (1u << 2), 0u);
    ASSERT_EQ(cpu[0].interrupt & (1u << 3), 1u << 3);
    mem_write32(mem, desc->base + desc->clock_gate_offset[0], 0u);
    ASSERT_EQ(cpu[0].interrupt & (1u << 3), 0u);
    ASSERT_TRUE(periph_interrupt_pending(periph, (int)from0));
    ASSERT_EQ(mem_read32(mem, desc->base + desc->status_offset[0] + 8u),
              status_bits);
    mem_write32(mem, desc->base + desc->clock_gate_offset[0], UINT32_MAX);
    ASSERT_EQ(mem_read32(mem, desc->base + desc->clock_gate_offset[0]), 1u);
    ASSERT_EQ(cpu[0].interrupt & (1u << 3), 1u << 3);

    /* Status is hardware-owned; the version word obeys its documented mask. */
    mem_write32(mem, desc->base + desc->status_offset[0] + 8u, 0u);
    ASSERT_EQ(mem_read32(mem, desc->base + desc->status_offset[0] + 8u),
              status_bits);
    mem_write32(mem, desc->base + desc->date_offset[1], UINT32_MAX);
    ASSERT_EQ(mem_read32(mem, desc->base + desc->date_offset[1]),
              desc->date_writable_mask);

