levkropp/flexe/tests/test_esp32s3_extmem.c
    mem_write32(mem, software, 0u);
    ASSERT_FALSE(periph_interrupt_pending(periph, (int)from0));
    ASSERT_EQ(cpu[0].interrupt & (1u << 3), 0u);
    ASSERT_EQ(mem_read32(mem, desc->base + desc->status_offset[0] + 8u),
              1u << (from1 - 64u));
    mem_write32(mem, software + desc->software_interrupt_stride, 0u);
    ASSERT_EQ(cpu[1].interrupt & 1u, 0u);

    int before = periph_unhandled_count(periph);
    ASSERT_EQ(mem_read32(mem, desc->base + 0x1A0u), 0u);
    mem_write32(mem, desc->base + 0x1A0u, 1u);
    ASSERT_EQ(periph_unhandled_count(periph), before + 2);
    ASSERT_EQ(mem_unmapped_count(mem), 0u);

    periph_destroy(periph);
    mem_destroy(mem);
}

TEST(peripherals_model_target_described_rtc_calibration) {
    const flexe_target_desc_t *s3 =
        flexe_target_by_id(FLEXE_TARGET_ESP32S3);
    const flexe_rtc_calibration_desc_t *desc = &s3->rtc_calibration;
    xtensa_mem_t *mem = mem_create_for_target(s3);
    esp32_periph_t *periph = periph_create(mem);
    ASSERT_TRUE(mem != NULL);
    ASSERT_TRUE(periph != NULL);
    if (!mem || !periph) {
        periph_destroy(periph);
        mem_destroy(mem);
        return;
    }

    uint32_t cfg0 = desc->base[0] + desc->config_offset;
    uint32_t value0 = desc->base[0] + desc->value_offset;
    uint32_t timeout0 = desc->base[0] + desc->timeout_offset;
    ASSERT_EQ(mem_read32(mem, cfg0), desc->config_reset);
    ASSERT_EQ(mem_read32(mem, cfg0),
              desc->config_reset | desc->ready_mask);
    ASSERT_EQ(mem_read32(mem, value0), 585u << desc->result_shift);
    ASSERT_EQ(mem_read32(mem, timeout0),
              desc->timeout_reset & desc->timeout_writable_mask);

    uint32_t one_shot = (1024u << desc->cycles_shift) |
                        desc->start_mask;
    mem_write32(mem, cfg0, one_shot);
    ASSERT_EQ(mem_read32(mem, cfg0), one_shot);
    ASSERT_EQ(mem_read32(mem, cfg0), one_shot | desc->ready_mask);
    ASSERT_EQ(mem_read32(mem, value0), 301176u << desc->result_shift);
    mem_write32(mem, cfg0, one_shot & ~desc->start_mask);
    ASSERT_EQ(mem_read32(mem, cfg0), one_shot & ~desc->start_mask);

    mem_write32(mem, timeout0, 0x12345679u);
    ASSERT_EQ(mem_read32(mem, timeout0),
              0x12345679u & desc->timeout_writable_mask);

    /* Each timer group owns independent calibration state. */
    uint32_t cfg1 = desc->base[1] + desc->config_offset;
    uint32_t value1 = desc->base[1] + desc->value_offset;
    uint32_t xtal32k = (10u << desc->cycles_shift) |
                       (2u << desc->clock_select_shift) |
                       desc->start_mask;
    mem_write32(mem, cfg1, 0u);
    mem_write32(mem, cfg1, xtal32k);
    ASSERT_EQ(mem_read32(mem, cfg1), xtal32k);
    ASSERT_EQ(mem_read32(mem, cfg1), xtal32k | desc->ready_mask);
    ASSERT_EQ(mem_read32(mem, value1), 12207u << desc->result_shift);
    ASSERT_EQ(mem_read32(mem, value0), 301176u << desc->result_shift);

    int before = periph_unhandled_count(periph);
    ASSERT_EQ(mem_read32(mem, desc->base[0] + 0x084u), 0u);
    mem_write32(mem, desc->base[1] + 0x084u, 1u);
    ASSERT_EQ(periph_unhandled_count(periph), before + 2);
    ASSERT_EQ(mem_unmapped_count(mem), 0u);

    periph_destroy(periph);
    mem_destroy(mem);
}

TEST(peripherals_model_target_described_internal_regi2c) {
    const flexe_target_desc_t *s3 =
        flexe_target_by_id(FLEXE_TARGET_ESP32S3);
    const flexe_regi2c_desc_t *desc = &s3->regi2c;
    xtensa_mem_t *mem = mem_create_for_target(s3);
    esp32_periph_t *periph = periph_create(mem);
    ASSERT_TRUE(mem != NULL);
    ASSERT_TRUE(periph != NULL);
    if (!mem || !periph) {
        periph_destroy(periph);
        mem_destroy(mem);
        return;
    }

    uint32_t host0 = desc->base + desc->command_offset;
    uint32_t host1 = host0 + desc->command_stride;
    uint32_t write = desc->command_start_mask | desc->command_write_mask |
                     0x66u | (3u << desc->address_shift) |
                     (0xA5u << desc->data_shift);
    mem_write32(mem, host1, write | desc->command_busy_mask);
    ASSERT_EQ(mem_read32(mem, host1), write);

    uint32_t read = desc->command_start_mask | 0x66u |
                    (3u << desc->address_shift);
    mem_write32(mem, host0, read);
    ASSERT_EQ(mem_read32(mem, host0),
              read | (0xA5u << desc->data_shift));
    ASSERT_EQ(mem_read32(mem, host0) & desc->command_busy_mask, 0u);

    /* A different internal slave/register has independent storage. */
    mem_write32(mem, host0, desc->command_start_mask | 0x69u |
                            (3u << desc->address_shift));
    ASSERT_EQ((mem_read32(mem, host0) & desc->data_mask) >>
              desc->data_shift, 0u);

    uint32_t control = desc->base + desc->analog_control_offset;
    mem_write32(mem, control, desc->bbpll_stop_low_mask);
    ASSERT_EQ(mem_read32(mem, control), desc->bbpll_stop_low_mask);
    ASSERT_EQ(mem_read32(mem, control),
              desc->bbpll_stop_low_mask | desc->bbpll_done_mask);
    mem_write32(mem, control, desc->bbpll_stop_high_mask);
    ASSERT_EQ(mem_read32(mem, control), desc->bbpll_stop_high_mask);

    uint32_t config = desc->base + desc->config_offset;
    uint32_t config2 = desc->base + desc->config2_offset;
    mem_write32(mem, config, 0xFFFFBFFFu);
    mem_write32(mem, config2, 0x0001FF40u);
    ASSERT_EQ(mem_read32(mem, config), 0xFFFFBFFFu);
    ASSERT_EQ(mem_read32(mem, config2), 0x0001FF40u);

    /* The adjacent ROM-facing SAR2 controller is target-described rather
     * than recognized by firmware PC. Its FSM is ready synchronously in fast
     * mode while software-owned control and configuration bits retain state. */
    ASSERT_EQ(desc->aux_register_count, 2u);
    uint32_t txdc_status = desc->base + desc->aux_register[0].offset;
    ASSERT_EQ(mem_read32(mem, txdc_status), 0x01000000u);
    mem_write32(mem, txdc_status, 0x00113CF3u);
    ASSERT_EQ(mem_read32(mem, txdc_status), 0x01113CF3u);

    uint32_t sar_status = desc->base + desc->aux_register[1].offset;
    ASSERT_EQ(mem_read32(mem, sar_status), 0x07000000u);
    mem_write32(mem, sar_status, UINT32_MAX);
    ASSERT_EQ(mem_read32(mem, sar_status), UINT32_MAX);
    mem_write32(mem, sar_status, 0u);
    ASSERT_EQ(mem_read32(mem, sar_status), 0x07000000u);

    /* The adjacent private-PHY window retains ordinary configuration words.
     * Conversion results are hardware-owned, so a headless quiet RF input
     * reads zero and guest writes cannot manufacture samples. */
    int before = periph_unhandled_count(periph);
    uint32_t private_config = desc->base + 0x05Cu;
    mem_write32(mem, private_config, 0x55AA1234u);
    ASSERT_EQ(mem_read32(mem, private_config), 0x55AA1234u);

    uint32_t sample = desc->base + desc->result_bank.offset +
                      3u * desc->result_bank.stride;
    ASSERT_EQ(mem_read32(mem, sample), 0u);
    mem_write32(mem, sample, UINT32_MAX);
    ASSERT_EQ(mem_read32(mem, sample), 0u);

    /* The RF-frequency memory is an indexed hardware register file. A write
     * strobe commits the data port, index selection publishes the saved word,
     * and a channel operation finishes synchronously in functional mode. */
    const flexe_regi2c_indexed_memory_desc_t *indexed =
        &desc->indexed_memory;
    uint32_t indexed_control = desc->base + indexed->control_offset;
    uint32_t indexed_read = desc->base + indexed->read_data_offset;
    uint32_t indexed_write = desc->base + indexed->write_data_offset;
    uint32_t indexed_status = desc->base + indexed->status_offset;
    uint32_t indexed_result = desc->base + indexed->result_offset;
    uint32_t memory_index = 42u;
    mem_write32(mem, indexed_write, 0xA55A1234u);
    mem_write32(mem, indexed_control,
                memory_index | indexed->write_trigger_mask);
    ASSERT_EQ(mem_read32(mem, indexed_read), 0xA55A1234u);
    mem_write32(mem, indexed_control, 7u);
    ASSERT_EQ(mem_read32(mem, indexed_read), 0u);
    mem_write32(mem, indexed_control, memory_index);
    ASSERT_EQ(mem_read32(mem, indexed_read), 0xA55A1234u);

    uint32_t channel = 14u;
    uint32_t operation_index =
        channel << indexed->index_to_result_shift;
    mem_write32(mem, indexed_control,
                operation_index | indexed->operation_trigger_mask);
    ASSERT_EQ(mem_read32(mem, indexed_status) & indexed->busy_mask, 0u);
    ASSERT_EQ(mem_read32(mem, indexed_result) &
              indexed->result_index_mask,
              channel << indexed->result_index_shift);

    /* Data/status/result ports are hardware-owned. */
    uint32_t selected_data = mem_read32(mem, indexed_read);
    uint32_t selected_result = mem_read32(mem, indexed_result);
    mem_write32(mem, indexed_read, UINT32_MAX);
    mem_write32(mem, indexed_status, UINT32_MAX);
    mem_write32(mem, indexed_result, UINT32_MAX);
    ASSERT_EQ(mem_read32(mem, indexed_read), selected_data);
    ASSERT_EQ(mem_read32(mem, indexed_status) & indexed->busy_mask, 0u);
    ASSERT_EQ(mem_read32(mem, indexed_result), selected_result);
    ASSERT_EQ(periph_unhandled_count(periph), before);

    /* Addresses beyond the target-described private bank stay diagnostic. */
    uint32_t unsupported = desc->base + desc->private_register_offset +
                           desc->private_register_size;
    ASSERT_EQ(mem_read32(mem, unsupported), 0u);
    mem_write32(mem, unsupported, 1u);
    ASSERT_EQ(periph_unhandled_count(periph), before + 2);
    ASSERT_EQ(mem_unmapped_count(mem), 0u);

